cypress/fixtures/prestamos/consultarPagoPrestamos.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sn="http://www.bncr.fi.cr/soa/SN_ConsultaPagoPrestamos">
   <soapenv:Header/>
   <soapenv:Body>
      <sn:solicitud>
         <sn:encabezado>
            <sn:fechaHoraConsumo>2020-01-26T19:15:54.294Z</sn:fechaHoraConsumo>
            <sn:canalConsumidor>IBP</sn:canalConsumidor>
            <sn:usuarioConsumidor>113720104</sn:usuarioConsumidor>
            <sn:direccionIPConsumo>?</sn:direccionIPConsumo>
            <sn:nombreServicio>?</sn:nombreServicio>
         </sn:encabezado>
         <sn:cuerpo>
            <sn:entradaServicio>
               <!--Optional:-->
               <sn:codigoEmpresa>1</sn:codigoEmpresa>
               <!--Optional:-->
               <sn:codigoAgencia>83</sn:codigoAgencia>
               <!--Optional:-->
               <sn:codigoSubAplicacion>1</sn:codigoSubAplicacion>
               <!--Optional:-->
               <sn:numeroPrestamo>30575534</sn:numeroPrestamo>
               <!--Optional:-->
               <sn:tipoPago>E</sn:tipoPago>
               <!--Optional:-->
               <sn:cantidadCuotas>0</sn:cantidadCuotas>
               <!--Optional:-->
               <sn:mtoPago>10.35</sn:mtoPago>
            </sn:entradaServicio>
         </sn:cuerpo>
      </sn:solicitud>
   </soapenv:Body>
</soapenv:Envelope>